include(${CMAKE_CURRENT_LIST_DIR}/../../env.cmake)
# ============================================================
# 头文件路径
# ============================================================
set(AOV_INCLUDE_DIRS
    ${CMAKE_CURRENT_LIST_DIR}
    )

# ============================================================
# 由 Solution 工程直接编译）
# ============================================================
set(AOV_SOURCE_DIRS
    ${CMAKE_CURRENT_LIST_DIR}/aov_helper.c
    )

# ============================================================
# 预编译库
# ============================================================
set(AOV_LIBS
    ${CMAKE_CURRENT_LIST_DIR}/${CMAKE_BOARDSYS}/libaov.a
    )
